driver-tests/bpelse/scenarios/PurchaseOrder/OrderTransformCompApp/test/OrderTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <CustomerHistoryEntries xmlns="http://xml.netbeans.org/schema/custhistory" xmlns:ns="http://xml.netbeans.org/schema/orders" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://xml.netbeans.org/schema/custhistory custhistory.xsd">
      <CustomerHistoryEntry>
        <CustomerNumber>CUST606</CustomerNumber>
        <OrderLookupInfo>
          <OrderNumber>ORD10001</OrderNumber>
          <PURCH_ORD_NO>POD0002</PURCH_ORD_NO>
          <ITM_NUMBER>ITM210</ITM_NUMBER>
          <ITM_NUMBER>ITM101</ITM_NUMBER>
          <OrderText>This order is a rush</OrderText>
        </OrderLookupInfo>
      </CustomerHistoryEntry>
      <CustomerHistoryEntry>
        <CustomerNumber>CUST445</CustomerNumber>
        <OrderLookupInfo>
          <OrderNumber>ORD9999</OrderNumber>
          <PURCH_ORD_NO>POD9991</PURCH_ORD_NO>
          <ITM_NUMBER>ITM605</ITM_NUMBER>
          <ITM_NUMBER>ITM339</ITM_NUMBER>
          <ITM_NUMBER>ITM034</ITM_NUMBER>
          <OrderText>This is marked for resale</OrderText>
        </OrderLookupInfo>
      </CustomerHistoryEntry>
    </CustomerHistoryEntries>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
